var table = [
		["วัน/เวลา",
		510,
		565,
		620,
		675,
		730,
		785,
		840,
		895,
		950
		],
	    [
	    "วันจันทร์",
	    "อ20205 ครูAshley 536",
	    "จ20201 ครูสาวิตรี 536",
	    "ค22101 ครูเวียงทอง 536",
	    "พักกลางวัน",
	    "ส22101 ครูธญศศิ 536",
	    "ค22101 ครูอัญชลี 536",
	    "ว22101 ครูรัตนพร 521",
	    "ว22101 ครูรัตนพร 521",
	    "กิจกรรม 5ส 536"
	    ],
	    [
	    "วันอังคาร",
	    "ค22111 ครูเวียงทอง 511",
	    "อ22101 ครูศุภลักษณ์ 536",
	    "ก22901 ครูรัชดาพร ธ.2",
	    "พักกลางวัน",
	    "ศ22101 ครูมุกมณี ศ1",
	    "ศ22101 ครูมุกมณี ศ1",
	    "ส22101 ครูธญศศิ 536",
	    "ส20233 ที่ปรึกษา 536",
	    "ค20203 ครูชโลม 536"
	    ],
	    [
	    "วันพุธ",
	    "ท22101 ครูพนัชกร 536"
	    ,"ว20207 ครูอาทิตย์ 536"
	    ,"ว20207 ครูอาทิตย์ 536",
	    "พักกลางวัน",
	    "ว20205 ครูปิยวัฒน์ 536",
	    "ค22101 ครูอัญชลี 536",
	    "อ22101 ครูศุภลักษณ์ 536",
	    "กิจกรรม ชุมนุม",
	    "กิจกรรม 5ส 536"
	    ],
	    [
	    "วันพฤพัสบดี",
	    "พ22111 ครูพัฒนชาติ พ.1",
	    "ค22211 ครูเวียงทอง 511",
	    "ส22111 ครูเฉลิมขวัญ 536",
	    "พักกลางวัน",
	    "อ22101 ครูศุภลักษณ์ 536",
	    "ส22101 ครูธญศศิ 416",
	    "ท22101 ครูพนัชกร 536",
	    "กิจกรรม เครื่องแบบ",
	    "กิจกรรม เพื่อสังคมและสาธาฯ"
	    ],
	    ["วันศุกร์",
	    "ง22111 ครูกุญภัฎ 536",
	    "ค22101 ครูอัญชลี 536",
	    "ท22101 ครูพนัชกร 536",
	    "พักกลางวัน",
	    "พ22101 ครูทัศนีย์ 536",
	    "ว22101 ครูรัตนาพร 536",
	    "อ22205 ครูสุภาพร 536",
	    "ว22171 ครูชฎาพร คอม1",
	    "กิจกรรม 5ส"
	    ]
	];
function autoRefresh() {
    document.getElementById("curPeriod").innerHTML = table[new Date().getDay().toString()][Math.floor((new Date().getHours() * 60 + new Date().getMinutes() - 455)/55)];
}
autoRefresh();
setInterval("autoRefresh()", 1000);
